Jiangchunjun/Project_NFC_1_10V/Application/src/modules/I2C/i2c_driver_samd21.c
/** ----------------------------------------------------------------------------
// i2c_driver_samd21.c
// -----------------------------------------------------------------------------
// (c) Osram spa
//     Via Castagnole 65/a
//     31100 Treviso (I)
//
//
// The content of this file is intellectual property of OSRAM spa. It is
// confidential and not intended for any public release. All rights reserved.
//
//
// Indent style: Replace tabs by spaces, 4 spaces per indentation level
//
// Initial version: 2014-12, g.marcolin@osram.it
//
// Change History:
//
// $Author: j.eisenberg $
// $Revision: 13855 $
// $Date: 2018-06-19 21:21:56 +0800 (Tue, 19 Jun 2018) $
// $Id: i2c_driver_samd21.c 13855 2018-06-19 13:21:56Z j.eisenberg $
// $URL: https://app-ehnsvn02.int.osram-light.com/svn/EC/Toolbox1.0/I2c/tags/v1.7/Src/i2c_driver_samd21.c $
//
// -----------------------------------------------------------------------------
*/

/** \addtogroup I2cDriverAPI
 * \{
 *   \file
 *   \addtogroup I2cDriverSAMD21
 *   \{
 *      \file
 *      \brief I2c driver using DMAC for Atmel SAM D21
 *   \}
 * \}
 */

#include <stdint.h>
#include <stdbool.h>

#include <samd21.h>
#include <dmac.h>
#include <sercom.h>
#include <gclk.h>
#include <system.h>
#include <port.h>
#define MODULE_I2C
#include "Config.h"

#include "ConfigDmacSamD21.h"
#include "Dmac/DmacSamD21.h"

#include "i2c_driver.h"
#include "i2c_userinterface.h"
#include "i2c_parameters_samd21.h"
#include "i2c_local.h"

//-----------------------------------------------------------------------------
// local variables
//-----------------------------------------------------------------------------
static uint32_t i2c_read_addr_register;
static bool     i2c_trigger_read_request;
DmacDescriptor *transfer_descriptor_ch_write;
DmacDescriptor *transfer_descriptor_ch_read;

//-----------------------------------------------------------------------------
// global variables
//-----------------------------------------------------------------------------
i2c_driver_feedback_struct_t i2c_driver_feedback_struct;

extern i2c_local_state_t *i2c_local_struct;

uint8_t i2_master_dma_tx_data_buffer[M24LRxx_MAX_WRITE_LENGTH + M24LRxx_DATA_ADDR_WIDTH];


//-----------------------------------------------------------------------------
// loacl functions
//-----------------------------------------------------------------------------
/**
 * \brief SAMD21 DMAC transcriptors initialization
 */
void initialize_dmac_transcriptors(void)
{
    // get pointer to first transfer descriptor for channel write
    transfer_descriptor_ch_write =
            DmacGetFirstTransferDescriptor(SAMD21_DMAC_CH_I2C_TX);

    // get pointer to first transfer descriptor for channel read
    transfer_descriptor_ch_read =
            DmacGetFirstTransferDescriptor(SAMD21_DMAC_CH_I2C_RX);

    // First Transfer Descriptor Write Channel
    // initialize DMAC write channel descriptor
    transfer_descriptor_ch_write->BTCTRL.bit.BEATSIZE =
                                      DMAC_BTCTRL_BEATSIZE_BYTE_Val;
    transfer_descriptor_ch_write->BTCTRL.bit.SRCINC = true;
    transfer_descriptor_ch_write->BTCTRL.bit.DSTINC = false;
    transfer_descriptor_ch_write->BTCTRL.bit.VALID = true;
    // set destination address
    transfer_descriptor_ch_write->DSTADDR.reg =
                                      (uint32_t) (&I2C_SERCOM->I2CM.DATA.reg);
    // pointer to next descriptor set to 0 (no more descriptors in list)
    transfer_descriptor_ch_write->DESCADDR.reg = 0;

    // First Transfer Descriptor Read Channel
    transfer_descriptor_ch_read->BTCTRL.bit.BEATSIZE =
                                      DMAC_BTCTRL_BEATSIZE_BYTE_Val;
    transfer_descriptor_ch_read->BTCTRL.bit.SRCINC = false;
    transfer_descriptor_ch_read->BTCTRL.bit.DSTINC = true;
    transfer_descriptor_ch_read->BTCTRL.bit.VALID = true;
    // set source address
    transfer_descriptor_ch_read->SRCADDR.reg =
                                      (uint32_t) (&I2C_SERCOM->I2CM.DATA.reg);
    // pointer to next descriptor set to 0 (no more descriptors in list)
    transfer_descriptor_ch_read->DESCADDR.reg = 0;
}

//-----------------------------------------------------------------------------
/**
 * \brief I2C read/write/error irq manager
 */
void i2c_master_irq(void)
{
    uint32_t intflag_reg;
    uint32_t status_reg;

    // disable Error IRQ
    I2C_SERCOM->I2CM.INTENCLR.reg = SERCOM_I2CM_INTENSET_ERROR;

    // read IRQ flags
    intflag_reg = I2C_SERCOM->I2CM.INTFLAG.reg;
    // read status register
    status_reg = I2C_SERCOM->I2CM.STATUS.reg;

    // on Error
    if (intflag_reg & SERCOM_I2CM_INTFLAG_ERROR)
    {
        // set I2C driver status
        i2c_driver_feedback_struct.status = I2C_DRIVER_STATUS_ERROR;

        // on DMA Transfer Length Error
        if (status_reg & SERCOM_I2CM_STATUS_LENERR)
        {
            // set I2C driver status
            i2c_driver_feedback_struct.status = I2C_DRIVER_STATUS_NACK;
        }
        // on NACK
        else if (status_reg & SERCOM_I2CM_STATUS_RXNACK)
        {
            // set I2C driver status
            i2c_driver_feedback_struct.status = I2C_DRIVER_STATUS_NACK;
        }

    }
    // clear IRQ flag ERROR
    I2C_SERCOM->I2CM.INTFLAG.reg = SERCOM_I2CM_INTENSET_ERROR;

    // enable Error IRQ
    I2C_SERCOM->I2CM.INTENSET.reg = SERCOM_I2CM_INTENSET_ERROR;
}

//------------------------------------------------------------------------------
/**
 * \brief SAMD21 Irq handler for the writings
 * \param irq_pend_reg
 */
void i2c_master_irq_dmac_handler_ch_write(uint32_t irq_pend_reg)
{
    // handle DMAC Channel Transfer Complete IRQ
     if (DMAC_INTPEND_TCMPL & irq_pend_reg)
     {
         if(true == i2c_trigger_read_request)
         {
             // set trigger read request flag to false
             i2c_trigger_read_request = false;

             // start I2C read operation
             I2C_SERCOM->I2CM.ADDR.reg = i2c_read_addr_register;
         }
         else
         {
             // set I2C driver status
             i2c_driver_feedback_struct.status = I2C_DRIVER_STATUS_DONE_TX;
         }
         // clear IRQ - Transfer Complete
         DMAC->INTPEND.reg = (DMAC_INTPEND_TCMPL | SAMD21_DMAC_CH_I2C_TX);
     }

