Jiangchunjun/Project_NFC_1_10V/Application/src/modules/I2C/i2c_driver_samd21.c
     // handle DMAC Channel Transfer Error IRQ
     if (DMAC_INTPEND_TERR & irq_pend_reg)
     {
         // set I2C driver status
         i2c_driver_feedback_struct.status = I2C_DRIVER_STATUS_ERROR;

         // clear IRQ - Transfer Error
         DMAC->INTPEND.reg = (DMAC_INTPEND_TERR | SAMD21_DMAC_CH_I2C_TX);
     }
}

//------------------------------------------------------------------------------
/**
 * \brief SAMD21 Irq handler for the readings
 * \param irq_pend_reg
 */
void i2c_master_irq_dmac_handler_ch_read(uint32_t irq_pend_reg)
{
    // handle DMAC Channel Transfer Complete IRQ
    if (DMAC_INTPEND_TCMPL & irq_pend_reg)
    {
        // read-out CRC-16
        i2c_driver_feedback_struct.crc_16 = (uint16_t)(DMAC->CRCCHKSUM.reg);

        // restart CRC DMAC-CRC (enable and set start value)
        DmacCrcRestart(I2C_CRC_START_VALUE);

        // set I2C driver status
        i2c_driver_feedback_struct.status = I2C_DRIVER_STATUS_DONE_RX;

        // clear IRQ - Transfer Complete
        DMAC->INTPEND.reg = (DMAC_INTPEND_TCMPL | SAMD21_DMAC_CH_I2C_RX);
    }

    // handle DMAC Channel Transfer Error IRQ
    if (DMAC_INTPEND_TERR & irq_pend_reg)
    {
        // set I2C driver status
        i2c_driver_feedback_struct.status = I2C_DRIVER_STATUS_ERROR;

        // clear IRQ - Transfer Error
        DMAC->INTPEND.reg = (DMAC_INTPEND_TERR | SAMD21_DMAC_CH_I2C_RX);
    }
}


//-----------------------------------------------------------------------------
// global functions
//-----------------------------------------------------------------------------
/**
 * \brief I2C driver DMA channel initialization
*/
void I2cDrvMasterInitDma(void)
{
    // Initialize DMAC Channel I2C - Write

    // perform reset of DMAC Channel I2C Write
    DmacResetChannel(SAMD21_DMAC_CH_I2C_TX);

    // select DMAC Channel I2C Write
    DMAC->CHID.reg = SAMD21_DMAC_CH_I2C_TX;

    // set trigger source and trigger action (1 trigger required for each beat)
    // set channel priority level
    DMAC->CHCTRLB.reg = (DMAC_CHCTRLB_TRIGSRC(I2C_DMAC_TX_TRIGGER)
                      | DMAC_CHCTRLB_TRIGACT(DMAC_CHCTRLB_TRIGACT_BEAT_Val)
                      | DMAC_CHCTRLB_LVL(SAMD21_DMAC_CH_I2C_LVL_PRIORITY));

    // clear all IRQs for the selected DMAC channel
    DMAC->CHINTFLAG.reg =
            (DMAC_CHINTENSET_TERR | DMAC_CHINTENSET_TCMPL | DMAC_CHINTENSET_SUSP);

    // enable Error and Transfer Complete IRQs for the selected DMAC channel
    DMAC->CHINTENSET.reg = (DMAC_CHINTENSET_TERR | DMAC_CHINTENSET_TCMPL);

    // configure DMAC IRQ handler for Channel I2C-Write
    DmacInitChIrqHandler(SAMD21_DMAC_CH_I2C_TX, i2c_master_irq_dmac_handler_ch_write);


    // Initialize DMAC Channel I2C - Read

    // perform reset of DMAC Channel I2C Read
    DmacResetChannel(SAMD21_DMAC_CH_I2C_RX);

    // select DMAC Channel I2C Read
    DMAC->CHID.reg = SAMD21_DMAC_CH_I2C_RX;

    // set trigger source and trigger action (1 trigger required for each beat)
    // set channel priority level
    DMAC->CHCTRLB.reg = (DMAC_CHCTRLB_TRIGSRC(I2C_DMAC_RX_TRIGGER)
                      | DMAC_CHCTRLB_TRIGACT(DMAC_CHCTRLB_TRIGACT_BEAT_Val)
                      | DMAC_CHCTRLB_LVL(SAMD21_DMAC_CH_I2C_LVL_PRIORITY));

    // enable CRC16 calculation for channel SAMD21_DMAC_CH_I2C_RX
    DMAC->CRCCTRL.reg = (DMAC_CRCCTRL_CRCSRC(0x20 + SAMD21_DMAC_CH_I2C_RX)
                      |  DMAC_CRCCTRL_CRCPOLY_CRC16 | DMAC_CRCCTRL_CRCBEATSIZE_BYTE);

    // initialize CRCCHKSUM register to I2C_CRC_START_VALUE
    // required to disable CRC first, because register CRCCHSUM is enable protected
    DMAC->CTRL.reg &= ~DMAC_CTRL_CRCENABLE;
    DMAC->CRCCHKSUM.reg = I2C_CRC_START_VALUE;

    // clear all IRQs for the selected DMAC channel
    DMAC->CHINTFLAG.reg =
            (DMAC_CHINTENSET_TERR | DMAC_CHINTENSET_TCMPL | DMAC_CHINTENSET_SUSP);

    // enable Error and Transfer Complete IRQs for the selected DMAC channel
    DMAC->CHINTENSET.reg = (DMAC_CHINTENSET_TERR | DMAC_CHINTENSET_TCMPL);

    // configure DMAC IRQ handler for Channel I2C-Read
    DmacInitChIrqHandler(SAMD21_DMAC_CH_I2C_RX, i2c_master_irq_dmac_handler_ch_read);

    // preinitialize all Transfer descriptors for I2C
    initialize_dmac_transcriptors();

    // enable I2C DMA priority level
    DmacPriorityLevelEnable(SAMD21_DMAC_CH_I2C_LVL_PRIORITY);
}

//-----------------------------------------------------------------------------
/**
 * \brief I2C driver initialization
*/
void I2cDrvInit(void)
{
   uint8_t swrst_timeout = 0;
   uint8_t syncbusy_timeout = 0;

   // set I2C driver status
   i2c_driver_feedback_struct.status = I2C_DRIVER_STATUS_IDLE;

   // set trigger read request flag to false
   i2c_trigger_read_request = false;

   // Enable peripheral clock
   I2C_CLOCK_MASK_REG |= I2C_CLOCK_ENABLE_BIT_MASK; // //    PM->APBCMASK.reg
   // ToDo: why is the PORT Clock required for I2C ???
   PM->APBBMASK.bit.PORT_ = 1;

   // Set the clock channel
   GCLK->CLKCTRL.reg = (1 << 14) | I2C_CLOCK_SELECTION_ID | (I2C_CLOCK_GENERATOR << 8);

   // Reset the SERCOM peripheral
   I2C_SERCOM->I2CM.CTRLA.reg = SERCOM_I2CS_CTRLA_SWRST;

   // Wait until reset is completed
   while ( (I2C_SERCOM->I2CM.CTRLA.reg & SERCOM_I2CS_CTRLA_SWRST == 1) && (swrst_timeout < 0xFF) )
   {
       swrst_timeout++;
   }

   // SPEED = 0 (100kHz - 400kHz)
   // SDAHOLD = 2 (300ns-600ns hold time) -> NFCTAG - tCLQX tDH Data out hold time 100 -> already set
   // RUNSTDBY = 1 (enable I2C module in all sleep modes)
   // MODE = 5 (I2C master mode) --> OK
   I2C_SERCOM->I2CM.CTRLA.reg =    SERCOM_I2CM_CTRLA_MODE_I2C_MASTER | SERCOM_I2CM_CTRLA_SPEED(I2C_SPEED) |
                                   SERCOM_I2CM_CTRLA_SDAHOLD(2) | SERCOM_I2CM_CTRLA_RUNSTDBY;

   // Enable SmartMode: Master sends ACK / NACK on read access DATA.DATA
   I2C_SERCOM->I2CM.CTRLB.reg =    SERCOM_I2CM_CTRLB_SMEN;

   I2C_SERCOM->I2CM.BAUD.reg =     SERCOM_I2CM_BAUD_BAUD(I2C_BAUD_REG) | SERCOM_I2CM_BAUD_BAUDLOW(0) |
                                   SERCOM_I2CM_BAUD_HSBAUD(1) | SERCOM_I2CM_BAUD_HSBAUDLOW(0);

   // Setup SDA
   if ( I2C_SDA_PIN & 1 )
   {
       I2C_SDA_PORT.PMUX[I2C_SDA_PIN>>1].bit.PMUXO = I2C_SDA_AF;
   }
   else
   {
       I2C_SDA_PORT.PMUX[I2C_SDA_PIN>>1].bit.PMUXE = I2C_SDA_AF;
   }


