Jiangchunjun/Project_NFC_1_10V/Application/src/modules/I2C/i2c_driver_samd21.c
//     PORT_PINCFG_INEN = 0 ?
   I2C_SDA_PORT.PINCFG[I2C_SDA_PIN].reg = PORT_PINCFG_PMUXEN | PORT_PINCFG_INEN;


   // Setup SCL
   if ( I2C_SCL_PIN & 1 )
   {
       I2C_SCL_PORT.PMUX[I2C_SCL_PIN>>1].bit.PMUXO = I2C_SCL_AF;
   }
   else
   {
       I2C_SCL_PORT.PMUX[I2C_SCL_PIN>>1].bit.PMUXE = I2C_SCL_AF;
   }

   I2C_SCL_PORT.PINCFG[I2C_SCL_PIN].reg = PORT_PINCFG_PMUXEN | PORT_PINCFG_INEN;

   // Interrupts setup
   I2C_SERCOM->I2CM.INTENCLR.reg = 0xFFu;

   //I2C_SERCOM->I2CM.INTENSET.reg = SERCOM_I2CM_INTENSET_MB | SERCOM_I2CM_INTENSET_SB | SERCOM_I2CM_INTENSET_ERROR;

   // I2C IRQ enable
   NVIC_SetPriority(I2C_IRQ_NVIC, I2C_NFC_INT_PRIORITY);
   I2C_SERCOM->I2CM.INTFLAG.reg = SERCOM_I2CM_INTFLAG_MASK;
	 NVIC_ClearPendingIRQ( I2C_IRQ_NVIC );
	 I2C_SERCOM->I2CM.INTENSET.reg = SERCOM_I2CM_INTENSET_ERROR;
   NVIC_EnableIRQ(I2C_IRQ_NVIC);

   // Enable the I2C!
   I2C_SERCOM->I2CM.CTRLA.reg |= SERCOM_I2CM_CTRLA_ENABLE;
   while (((I2C_SERCOM->I2CM.SYNCBUSY.reg & SERCOM_I2CM_SYNCBUSY_ENABLE) != 0) && (syncbusy_timeout < 0xFF))
   {
       syncbusy_timeout++;
   }

   // set I2C bus from state 'unkown' to 'idle'
   // BUSSTATE[1:0] writing 1 forces I2C state from Unknown -> Idle
   //               required to poll SYNCBUSY.SYSOP
   I2C_SERCOM->I2CM.STATUS.reg = SERCOM_I2CM_STATUS_BUSSTATE(1);

   // configure and enable DMA for I2C
   // i2c_drv_master_init_dma();
}


//-----------------------------------------------------------------------------
/**
* \brief Stops I2c HW driver
* \param
* \param
*/
void I2cDrvStop(void)
{

}


//-----------------------------------------------------------------------------
/**
* \brief Starts an I2C frame
* \param dev_select_code: device address selection code
* \param length: the lenght of the frame which has to be transferred
*/
void I2cDrvStartTransfer(uint8_t dev_select_code, uint16_t length)
{
    // configure I2C for DMAC usage and send I2C start condition
    I2C_SERCOM->I2CM.ADDR.reg = SERCOM_I2CM_ADDR_ADDR(dev_select_code)
                              | SERCOM_I2CM_ADDR_LENEN
                              | SERCOM_I2CM_ADDR_LEN((length));

}

//-----------------------------------------------------------------------------
/**
* \brief Dummy function not needed for the SAMD21 itself. It is used to mantain
* the compatibility with XMC1300 driver
* \retval Dummy always 0
*/
uint8_t I2cDrvReadByte(void)
{
  return 0;
}


//-----------------------------------------------------------------------------
/**
* \brief Transmits a stop
*/
void I2cDrvStopTransfer(void)
{
    // it should be NOT read modify write operation, set other bits as defines if they are constant !
//    I2C_SERCOM->I2CM.CTRLB.reg |= SERCOM_I2CM_CTRLB_CMD(3);
    // ToDo: add define for config value of SERCOM_I2CM_CTRLB_SMEN
    I2C_SERCOM->I2CM.CTRLB.reg = (SERCOM_I2CM_CTRLB_CMD(3) | SERCOM_I2CM_CTRLB_SMEN);
}

//-----------------------------------------------------------------------------
/**
 * \brief Set ACK/NACK acknowledge
*/
void I2cDrvSetAcknowledge(i2c_ack_t acknowledge)
{
    if (I2C_ACK_YES == acknowledge)
    {
        I2C_SERCOM->I2CM.CTRLB.reg = SERCOM_I2CM_CTRLB_SMEN;
    }
    else
    {
        I2C_SERCOM->I2CM.CTRLB.reg = SERCOM_I2CS_CTRLB_ACKACT
                | SERCOM_I2CM_CTRLB_SMEN;
    }
}

//-----------------------------------------------------------------------------
/**
 * \brief Fill I2C TX write data into DMA buffer
 * \param address: TAG start address
 * \param data: pointer to data array
 * \param length: number of bytes to write
 */
// ToDo add check for length <= 4
// ToDo add check status should be NOT - BUSY
void I2cDrvWriteDataDma(uint16_t address, uint8_t *data, uint8_t length)
{
    uint8_t i1;

    // fill address into data TX DMA buffer
    i2_master_dma_tx_data_buffer[0] = address >> 8;
    i2_master_dma_tx_data_buffer[1] = (uint8_t) (0x00FF & address);

    // fill data into TX DMA buffer
    for (i1 = 0; i1 < length; i1++)
    {
        i2_master_dma_tx_data_buffer[i1 + 2] = data[i1];
    }

    // stop DMA channel before Transfer Descriptor can be modified
    DmacStopChannel(SAMD21_DMAC_CH_I2C_TX);

    // fill DMA structure
    // set source address
    transfer_descriptor_ch_write->SRCADDR.reg =
            (uint32_t) (i2_master_dma_tx_data_buffer + (length + 2));
    // set block length (+2 due to 16 bit I2C address)
    transfer_descriptor_ch_write->BTCNT.reg = length + 2;

    // set I2C driver status
    i2c_driver_feedback_struct.status = I2C_DRIVER_STATUS_BUSY;

    // start DMAC Write Channel after Transfer descriptors are modified
    // after transfer complete the DMA channel is disabled and must be enabled
    DmacStartChannel(SAMD21_DMAC_CH_I2C_TX);
}

//-----------------------------------------------------------------------------
/**
* \brief Wrapper function to write I2C data mantaining the compatibility with
* XMC1300 driver
* \param dev_sel_code: (0xA6) write request
* \param address: TAG start address
* \param data: pointer to data array
* \param length: data length
*/
void I2cDrvWriteData (uint8_t dev_sel_code, uint16_t address, uint8_t *data,
                      uint8_t length)
{
  // SAMD21: write DMAC w/o device select code
  I2cDrvWriteDataDma( address, data, length);
}

//-----------------------------------------------------------------------------
/**
* \brief Fill I2C RX read data into DMA buffer
* \param dev_sel_code: set to 0xA7 = read request
* \param address: i2c address
* \param data: pointer to data array
* \param length: data length
*/
// ToDo add check status should be NOT - BUSY
void I2cDrvReadDataDma(uint8_t dev_sel_code, uint16_t address,
                                  uint8_t *data, uint8_t length)
{
    // fill address into data TX DMA buffer
    i2_master_dma_tx_data_buffer[0] = address >> 8;
    i2_master_dma_tx_data_buffer[1] = (uint8_t)(0x00FF & address);

    // fill Transfer descriptor for sending address

    // stop DMA channel before Transfer Descriptor can be modified
    DmacStopChannel(SAMD21_DMAC_CH_I2C_TX);

    // set source address
    transfer_descriptor_ch_write->SRCADDR.reg =
            (uint32_t) (i2_master_dma_tx_data_buffer + 2);
    // set block length (2 bytes due to 16 bit I2C address)
    transfer_descriptor_ch_write->BTCNT.reg = 2;

    // set value for I2CM.ADDR.reg to trigger read operation
    i2c_read_addr_register = SERCOM_I2CM_ADDR_ADDR(dev_sel_code | 0x01)
                           | SERCOM_I2CM_ADDR_LENEN
                           | SERCOM_I2CM_ADDR_LEN((length + 1));

    // fill Transfer descriptor for reading

    // stop DMA channel before Transfer Descriptor can be modified
    DmacStopChannel(SAMD21_DMAC_CH_I2C_RX);

    // set destination address
    transfer_descriptor_ch_read->DSTADDR.reg =
            (uint32_t)(data + length);
    // set block length (+2 due to 16 bit I2C address)
    transfer_descriptor_ch_read->BTCNT.reg = length;

    // set I2C driver status
    i2c_driver_feedback_struct.status = I2C_DRIVER_STATUS_BUSY;

    // set trigger read request flag
    i2c_trigger_read_request = true;

    // start DMAC Read and Write Channel after Transfer descriptors are modified
    // after transfer complete the DMA channel is disabled and must be enabled
    DmacStartChannel(SAMD21_DMAC_CH_I2C_TX);
    DmacStartChannel(SAMD21_DMAC_CH_I2C_RX);
}

