Jiangchunjun/Project_NFC_1_10V/Application/src/modules/I2C/i2c_driver_samd21.c
//-----------------------------------------------------------------------------
/**
* \brief Wrapper function to read I2C data mantaining the compatibility with
* XMC1300 driver
* \param dev_sel_code: set to 0xA7 = read request
* \param address: TAG address
* \param data: pointer to data array
* \param length: data length
*/
void I2cDrvReadData(uint8_t dev_sel_code, uint16_t address,
                                  uint8_t *data, uint8_t length)
{
    I2cDrvReadDataDma(dev_sel_code, address, data, length);
}

//-----------------------------------------------------------------------------
/**
 * \brief Check the status of the RX channel of the driver
 * \return true if the RX DMAC channel is active
 */
bool I2cDrvIsRxBusy(void)
{
    return DmacChannelIsActive(SAMD21_DMAC_CH_I2C_RX);
}

//-----------------------------------------------------------------------------
/**
 * \brief Check the status of the TX channel of the driver
 * \return true if the TX DMAC channel is active
 */
bool I2cDrvIsTxBusy(void)
{
    return DmacChannelIsActive(SAMD21_DMAC_CH_I2C_TX);
}

//-----------------------------------------------------------------------------
/**
* \brief Dummy function not needed for the SAMD21 itself. It is used to mantain
* the compatibility with XMC1300 driver
*/
void I2cDrvUpdateStatus(void)
{
    return;
}

//-----------------------------------------------------------------------------
/**
 * \brief Issue a new I2c transfer.
 * \note Can be RX or TX, RX will always have the priority, even if a writing
 * procedure is already in progress.
 */
void start_transfer(void)
{
    uint16_t dev_select_code;

    if (i2c_transfer_direction_rx == i2c_local_struct->transfer_direction)
    {

        // read from tag register or memory area?
        // bit 7 set: read from tag register
        // bit 6 set: read from user memory area
        dev_select_code =
                (i2c_local_struct->rx_request.addr & 0xC000) ?
                M24LRxx_ADDR_REGISTER : M24LRxx_ADDR_DATA;

        // fill transfer data into DMA buffer and start transfer
        // mask most significant bit of address

        I2cDrvReadData (dev_select_code,
                          (i2c_local_struct->rx_request.addr & 0x3FFF),
                          i2c_local_struct->rx_request.data_ptr,
                          i2c_local_struct->rx_request.length);

        // start DMA transfer - Read
        I2cDrvStartTransfer(dev_select_code, M24LRxx_DATA_ADDR_WIDTH);
    }
    else // i2c_transfer_direction_tx == i2c_local_state.transfer_direction
    {
        // read from tag register or memory area?
        dev_select_code =
                (i2c_local_struct->tx_request.addr & 0xC000) ?
                M24LRxx_ADDR_REGISTER : M24LRxx_ADDR_DATA;

        // fill transfer data into DMA buffer
        // mask most significant bit of address
        I2cDrvWriteData (dev_select_code,
                           (i2c_local_struct->tx_request.addr & 0x3FFF),
                           i2c_local_struct->tx_request.data,
                           i2c_local_struct->tx_request.length);

        // start DMA transfer - Write
        // length = data_length + 2 = 2 bytes address + length of data
        I2cDrvStartTransfer (dev_select_code,
                             i2c_local_struct->tx_request.length + M24LRxx_DATA_ADDR_WIDTH);
    }
}

//-----------------------------------------------------------------------------
/**
* \brief Dummy function not needed for the SAMD21 itself. It is used to mantain
* the compatibility with XMC1300 driver
 * \return always true
 */
bool is_rx_request_completed(void)
{
    return true;
}

//-----------------------------------------------------------------------------
/**
* \brief Dummy function not needed for the SAMD21 itself. It is used to mantain
* the compatibility with XMC1300 driver
*/
void update_crc_calculation_on_rx(void)
{
    return;
}

//-----------------------------------------------------------------------------
/**
* \brief Dummy function not needed for the SAMD21 itself. It is used to mantain
* the compatibility with XMC1300 driver
*/
void init_crc_calculation_on_rx(void)
{
    return;
}

//-----------------------------------------------------------------------------
/**
* \brief Check if the last reveived I2c frame had a crc error
* \return true if there is no crc error
*/
bool is_crc_correct(void)
{
    return i2c_driver_feedback_struct.crc_16 == 0;
}



/** \} */ // I2cDriverSAMD21
/** \} */ // I2cDriver
